package dom;

import java.util.Arrays;

public class Zadachi4 {
    public static void main(String[] args) {
        // 11. Отсортировать массив строк по длине.
//        String[] array = {"elephant", "cat", "dog"};
//        Arrays.sort(array, (o1, o2) -> Integer.compare(o1.length(), o2.length()));
//        System.out.println(Arrays.toString(array));


        // 12. Найти и вывести все строки одинаковой длины.
//        String[] array = {"apple", "banana", "cherry", "dog", "cat"};
//        int maxLength = array[0].length();
//        for (String str : array) {
//            if (str.length() > maxLength) {
//                maxLength = str.length();
//            }
//        }
//        for (String str : array) {
//            if (str.length() == maxLength) {
//                System.out.println(str);
//            }
//        }


        // 13. Сравнить содержимое двух массивов целых чисел.
//            int[] array1 = {1, 2, 3};
//            int[] array2 = {1, 2, 3};


        // 14. Генерация нового массива из сумм элементов двух массивов.
//            int[] array1 = {1, 2, 3};
//            int[] array2 = {4, 5, 6};


        // 15. Найти уникальные значения в массиве строк.
//            String[] array = {"apple", "banana", "apple", "cherry", "banana"};


        // 16. Удалить дубликаты из массива строк.
//            String[] array = {"apple", "banana", "apple", "cherry", "banana"};


        // 17. Объединить два массива строк в один.
//            String[] array1 = {"apple", "banana"};
//            String[] array2 = {"cherry", "date"};


        // 18. Проверить, упорядочен ли массив строк по алфавиту.
//            String[] array = {"apple", "banana", "cherry"};


        // 19. Найти строки, начинающиеся с заданной буквы.
//            String[] array = {"apple", "banana", "apricot", "cherry"};
//            char target = 'a';


        // 20. Создать массив строк из первых букв элементов другого массива.
//            String[] array = {"apple", "banana", "cherry"};

    }
}
